<template>
  <div>
    <div class="agree-content overflow-container">
      <p>北京万相融通科技股份有限公司（以下称“我司”）根据您的需求向您提供行李搬运服务，您访问和使用有关网站、服务、应用程序、微信号上提供的行李搬运服务适用本用户服务协议（以下简称“协议”）。</p>
      <p>
        在您注册、使用有关网站、应用程序、微信号及预约、接受我司提供的行李搬运服务之前，请您认真阅读本协议。您选择并使用服务即视为您已充分阅读并接受本协议的所有条款，您同意本协议对您和我司具有法律约束力。本协议在北京市丰台区签订。</p>
      <div>
        <p>第一条 用户注册</p>
        <p>
          1.1为使用我司服务，您须在移动设备上下载“铁路伴侣”应用程序（以下称“铁路伴侣APP”）并进行注册，注册时您必须保证提供真实有效的信息、移动电话号码等，您知晓并同意，您一经成为铁路伴侣APP的注册用户，将会默认开通我司服务账户，账号及密码默认为铁路伴侣APP账户的账号及密码。</p>
        <p>1.2如果您是代表个人签订本协议，您应具有完全民事行为能力。</p>
      </div>
      <div>
        <p>第二条 服务内容</p>
        <p>您委托我司根据您的需求向您提供行李搬运服务。您可通过下载并安装到移动设备上的“铁路伴侣”应用程序选择并使用上述服务。</p>
      </div>
      <div>
        <p>第三条 合同订立</p>
        <p>您理解并同意，您通过铁路伴侣APP选择并使用我们的服务，即视为接受本《用户服务协议》并依据本协议与我司达成了合约（以下简称“合约”）。</p>
      </div>
      <div>
        <p>第四条 服务使用</p>
        <p>4.1您可以通过铁路伴侣APP预约行李搬运服务。我司将按照您的预约信息为您提供行李搬运服务。</p>
        <p>4.2我司将做出合理的努力，让您获得服务。但这受制于您请求服务之时对应车站是否有可提供服务的人员和工具。</p>
      </div>
      <div>
        <p>第五条 担保及承诺</p>
        <p>5.1您担保，您向我们提供的信息真实、准确、完整。我们在任何时候都有权验证您所提供的信息，并有权在不提供任何理由的情况下拒绝向您提供服务或拒绝您使用有关网站、服务、应用程序。</p>
        <p>5.2您使用我司服务或铁路伴侣APP，即表示您还同意以下事项：</p>
        <div>
          <p>a.您出于您个人用途使用服务或下载应用程序，并且不会转售给第三方;</p>
          <p>b.您不会将服务或应用程序用于非法目的，包括（但不限于）发送或存储任何非法资料或者用于欺诈目的;</p>
          <p>c.您不会利用服务或应用程序骚扰、妨碍他人或造成不便;</p>
          <p>d.您不会影响网络的正常运行;</p>
          <p>e.您不会尝试危害服务或应用程序;</p>
          <p>f.当我们提出合理请求时，您会提供身份证明。</p>
          <p>g.您将遵守国家/地区以及您在使用应用程序或服务时所处国家/地区、省和/或市的所有适用法律;</p>
        </div>
        <p>5.3如果您违反以上任一约定，我们保留立即终止向您提供服务和拒绝您使用有关网站、服务、应用程序的权利。</p>
      </div>

      <div>
        <p>第六条 付款及发票</p>
        <p>6.1您同意并认可铁路伴侣APP现行公示或未来更新的有关服务价格标准，您可以在网站上或铁路伴侣APP上查看有关服务的价格。这些价格可能会随时更新，您必须自行留意服务的价格。</p>
        <p>6.2您在订单受理后应根据铁路伴侣APP提示及时支付费用。逾期不支付费用，订单自动取消，我司不承担任何违约责任。</p>
        <p>
          6.3您在铁路伴侣APP上预约行李搬运服务时，应根据您的实际情况，如实填写个人信息、车次信息、行李件数、同行人数等信息，并按照铁路伴侣APP的提示付款。如果在实际提供服务时，您的信息与订单信息不符，我司有权要求您补缴相关费用，或仅提供与您订单内容及价款相对应的服务。如因此造成服务未能顺利完成，我司不承担任何违约责任。</p>
        <p>6.4在您下单后，如果您对订单中的行李搬运起点/终点、行李件数、同行人数等内容项进行变更，我司有权要求您根据变更内容补缴相关费用，或仅提供与您订单内容及价款相对应的服务。</p>
        <p>6.5当您取消订单时，您同意我司按照以下标准收取手续费：</p>
        <div>
          <p>a.未付款订单，不收取手续费;</p>
          <p>b.约定服务时间开始前2小时以上取消订单，不收取手续费;</p>
          <p>c.约定服务时间开始前30分钟以上、不足2小时的按订单总价50%计，不足30分钟的按订单总价100%计;</p>
          <p>d.约定服务时间开始后，不可取消订单，因用户原因导致订单未能执行，已收费用不予退还。</p>
        </div>

        <p>6.6请确保您持有与订单信息相符的车票和有效证件，否则我司有权拒绝为您提供服务，您可以按照本协议6.5的相关规定取消订单。</p>
        <p>6.7在使用相关服务时，请确保您遵守相关法律法规及铁路部门相关规定，否则我司有权拒绝为您提供服务，您可以按照本协议6.5的相关规定取消订单。</p>
        <p>
          6.8您在铁路伴侣APP可以使用您的第三方电子支付账户（包括但不限于微信支付账户或支付宝支付账户）进行支付。处理您使用服务相关的付款时，除了受到本《用户服务协议》的约束之外，还要受电子支付服务商及信用卡/借记卡发卡行的条款和政策的约束。我们对于电子支付服务商或银行发生的错误不承担责任。我们将获取与您使用服务相关的特定交易明细。在使用这些信息时我们将严格遵守相关法律法规和公司的各项政策。</p>
        <p>6.9在您提出开具发票的要求时，将由北京万相融通科技股份有限公司为您开具发票，您同意发票开具的规则及流程根据服务车站的实际规定执行。</p>
        <p>6.10如您对订单有异议，应当在约定服务时间开始后24小时内联系我们，我们将对您提出的异议进行解释和处理。</p>
      </div>

      <div>
        <p>第七条 赔偿</p>
        <p>
          您使用铁路伴侣APP的各应用程序及服务，即表示您接受本《用户服务协议》并同意：对于因以下事项产生的或与以下事项相关的任何及所有索赔、费用、赔偿、损失、债务和开销（包括但不限于律师费和诉讼费），您应该予以赔偿：</p>
        <div>
          <p>a.您触犯或违反本《用户服务协议》中的任何条款或任何适用的法律法规（无论此处是否提及）;</p>
          <p>b.您触犯任何第三方的任何权利;</p>
          <p>c.您滥用应用程序或服务;</p>
        </div>
      </div>


      <div>
        <p>第八条 责任</p>
        <p>
          8.1在网站或铁路伴侣APP或微信号上向您提供的信息、推荐的服务仅供您参考。我们将在合理的范围内尽力保证该等信息准确，但无法保证其中没有任何错误、缺陷、恶意软件和病毒。对于因使用（或无法使用）铁路伴侣APP、网站、微信号导致的任何损害（但排除死亡或人身伤害），我们不承担责任。此外，对于因使用（或无法使用）与网站或铁路伴侣APP的电子通信手段导致的任何损害，包括（但不限于）因电子通信传达失败或延时、第三方或用于电子通信的计算机程序对电子通信的拦截或操纵，以及病毒传输导致的损害，我们不承担责任。</p>

        <p>
          8.2您知悉并确认，您通过铁路伴侣APP预约的行李搬运服务由工作人员以我司的名义向您提供并对服务质量予以保证。我司将在合理范围内承担相应的责任。对于超出法律规定应当赔偿的部分或存在侵权责任人、违约责任人的，我司有权向有关当事人追偿。</p>
        <p>8.3如因您或者服务对象未能及时到达订单的约定地点，或票、证、人不符等原因，导致服务不能完成，我司不承担违约责任，已收取的费用不予退还。</p>

      </div>


      <div>
        <p>第九条 授权及许可</p>
        <p>9.1在您遵守本《用户服务协议》的前提下，我们授予您有限的、非排他性的、不可转让的如下许可：</p>
        <p>
          将一份应用程序副本下载并安装到您拥有或控制的单台移动设备上，并仅出于您自己的个人用途运行此应用程序副本。您不得：（1）以任何方式许可、再许可、出售、转售、转让、分配、分发服务或应用程序，或以其他方式进行商业开发或提供给任何第三方；（2）修改服务或应用程序，或者据此创建衍生产品；（3）创建指向服务的互联网“链接”，或在任何其他服务器或基于无线或互联网的设备上“设计”或“镜像”任何应用程序；（4）反向工程或访问应用程序设计或构建竞争产品或服务、使用类似于服务或应用程序的设想或图形来设计或构建产品，或抄袭服务或应用程序的任何设想、特点、功能或图形，或（5）启动自动程序或脚本，每秒发送多个服务器请求或过度加重服务或应用程序负担或妨碍其工作和/或性能的程序。</p>
        <p>
          9.2此外，您不得：（1）发送垃圾邮件或者以其他形式违反适用法律的重复或不受欢迎的邮件；（2）发送或存储侵权、淫秽、威胁、诽谤或者其他非法或侵权资料，包括危害儿童或触犯第三方隐私权的资料；（3）发送或存储包含软件病毒、蠕虫、木马或其他有害的计算机代码、文件、脚本、代理或程序的资料；（4）阻挠或扰乱网站、应用程序、服务或其所含数据的完整性或性能；（5）尝试未经授权地访问网站、应用程序、服务或其相关系统或网络。</p>
        <p>
          9.3在法律允许的最大范围内，我们将有权调查并起诉任何上述违法违规行为。我们可参与并协助执法部门起诉违反本《用户服务协议》的用户。如果我们认为任何内容违反本《用户服务协议》或以其他方式危害网站、平台及/或其中的服务或应用程序，我们保留在不另行通知的情况下随时删除或禁用对这些内容的访问权限的权利。</p>
      </div>

      <div>
        <p>第十条 知识产权政策</p>
        <p>我们遵守各类适用的知识产权法律法规，并希望用户也遵守。</p>
      </div>

      <div>
        <p>第十一条 第三方链接</p>
        <p>
          在您使用网站、应用程序、公众号期间，我们可能会不时地提供由第三方拥有并控制的网站链接，以便您跟第三方沟通，向其购买产品或服务，参加其提供的促销活动。该等链接会带领您离开网站、铁路伴侣APP，并且该等链接所指向的第三方网站内容不在我们的控制范围之内，这些第三方网站各自订立了条款、条件和隐私政策。因此，我们不会对这些网站的内容和活动负责，也不会承担任何义务，您应充分理解该等网站的内容及活动并自己全力承担浏览或访问这些网站的法律责任及风险。</p>
      </div>

      <div>
        <p>第十二条 合约期限</p>
        <p>12.1我们和您订立的这份合约是无固定期限合约。</p>
        <p>12.2您有权随时通过永久性删除智能手机上安装的应用程序来终止合约，这样将禁止您使用铁路伴侣APP及其中的应用程序和服务。您可以随时按照我们网站上的说明注销用户账户。</p>
        <p>12.3如果您做出以下行为，我们有权随时终止合约并立即生效（即禁止您使用应用程序和服务）:</p>
        <div>
          <p>a:您触犯或违反本《用户服务协议》中的任何条款;</p>
          <p>b:我们认为，您滥用应用程序或服务。我们没有义务提前通知合约终止。终止合约之后，我们将按照本《用户服务协议》给出相关通知。</p>
        </div>
      </div>

      <div>
        <p>第十三条 不可抗力</p>
        <p>
          遭受不可抗力事件的一方可暂行中止履行本协议项下的义务直至不可抗力事件的影响消除为止，并且无需为此承担违约责任，但应尽最大努力克服该事件，减少损失的扩大。不可抗力指各方不能控制、不可预见或即使预见亦无法避免的事件，该事件足以妨碍、影响或延误任何一方根据本协议履行其全部或部分义务。该事件包括但不限于列车停运、自然灾害、战争、政策变化、计算机病毒、黑客攻击或电信机构服务中断造成的事件。</p>
      </div>
      <div>
        <p>第十四条 其他</p>
        <p>14.1如果本《用户服务协议》的某一（些）条款被认定为无效而其他条款仍能保持有效且其执行不受影响，我们可决定是否继续履行该等其他条款。</p>
        <p>
          14.2我们保留随时修改或替换本《用户服务协议》条款，或者更改、暂停或中断服务或应用程序（包括但不限于，任何功能、数据库或内容的可用性）的权利。届时，我们只需在网站及/或铁路伴侣APP上发布通告或发送通知。您如果不同意我们对本《用户服务协议》所做的修改，您有权停止使用服务。如果您继续使用服务，则视为您接受我们对本《用户服务协议》所做的修改。</p>
        <p>14.3我们可以通过以下途径发送通知：在网站及/或铁路伴侣APP上张贴一般通知；或按照您在账户信息中登记的电子邮件地址或电话发送电子邮件或短信。</p>
        <p>14.4事先未经我们的书面同意，您不得转让本《用户服务协议》中的权利。</p>
        <p>14.5未成年人应在法定监护人的陪同下阅读本《用户服务协议》。各项条款内容的最终解释权及修改权归我司所有。</p>
        <p>14.6郑重提醒用户注意本《用户服务协议》中免除我司责任和加重用户义务的条款，请用户仔细阅读，自主考虑风险。</p>
      </div>

      <div>
        <p>第十五条 管辖</p>
        <p>
          约定本《用户服务协议》适用中国法律。本协议签订地为北京市丰台区，关于本《用户服务协议》的违约、终止、履行、解释或有效性，或者网站、铁路伴侣APP的使用所产生的或与其相关的任何冲突、赔偿或纠纷（统称为“争议”），由北京万相融通科技股份有限公司所在地人民法院管辖。</p>
      </div>
    </div>
    <footer class="agree-footer clearfix">
      <div class="agree-checkbox">
        <el-checkbox v-model="checked">已阅读并同意用户协议</el-checkbox>
      </div>
      <div class="agree-btn">
        <el-button type="primary" :disabled="!checked" @click="book">开始预订</el-button>
      </div>
    </footer>
  </div>
</template>
<script>
  import * as types from '../../../store/mutation-types'
  export default{
    data(){
      return {
        checked: false
      }
    },
    methods: {
      book(){
        this.$store.dispatch(types.MENU__USER_AGREEMENT__BOOK, this)
      }
    }
  }
</script>
<style>
  .agree-content {
    padding: 0.38rem;
  }

  .agree-content > p, .agree-content > div {
    margin-bottom: 0.5rem;
  }

  .agree-content p {
    line-height: 0.5rem;
    text-indent: 2em;
  }

  .agree-content > div > p {
    margin-bottom: 0.25rem;
  }

  .agree-checkbox {
    float: left;
    position: relative;
  }

  .agree-footer > div {
    line-height: 1.22rem;
  }

  /*将原有的input透明质设为0，隐藏*/
  .agree-checkbox input {
    opacity: 0;
    width: 0.54rem;
    height: 0.54rem;
    position: absolute;
    top: 0;
    left: 0;
  }

  .agree-btn {
    float: right;
  }

  .agree-btn:focus {
    outline: none;
  }

  .agree-btn button {
    padding: 0.15rem 0.3rem;
    font-size: 0.34rem;
  }

  .el-button a {
    color: #ffffff;
  }

  .el-checkbox__input.is-checked .el-checkbox__inner {
    background-color: #306ab4;
    border-color: #306ab4;
  }

  .el-checkbox__inner:hover {
    border-color: #306ab4;
  }

  .el-button--primary:focus, .el-button--primary:hover {
    background-color: #306ab4;
  }
</style>
